package scrape

import (
	"fmt"

	// importing Colly
	"github.com/gocolly/colly"
)

type hukam struct {
	date     string
	ang      int
	gurmukhi string
}

func GetTodaysHukamnama(url string) hukam {
	result := hukam{"[July 21, 2023, Friday 04:45 AM. IST]", 597, "ਹੇ ਪ੍ਰਭੂ ਜੀ! ਤੂੰ ਸਾਨੂੰ ਸਭ ਪਦਾਰਥ ਦੇਣ ਵਾਲਾ ਹੈਂ, ਦਾਤਾਂ ਦੇਣ ਵਿਚ ਤੂੰ ਕਦੇ ਖੁੰਝਦਾ ਨਹੀਂ, ਅਸੀ ਤੇਰੇ (ਦਰ ਦੇ) ਮੰਗਤੇ ਹਾਂ । ਮੈਂ ਤੈਥੋਂ ਕੇਹੜੀ ਸ਼ੈ ਮੰਗਾਂ? ਕੋਈ ਸ਼ੈ ਸਦਾ ਟਿਕੀ ਰਹਿਣ ਵਾਲੀ ਨਹੀਂ । (ਹਾਂ, ਤੇਰਾ ਨਾਮ ਸਦਾ-ਥਿਰ ਰਹਿਣ ਵਾਲਾ ਹੈ) ਹੇ ਹਰੀ! ਮੈਨੂੰ ਆਪਣਾ ਨਾਮ ਦੇਹ, ਮੈਂ ਤੇਰੇ ਨਾਮ ਨੂੰ ਪਿਆਰ ਕਰਾਂ ।੧।ਪਰਮਾਤਮਾ ਹਰੇਕ ਸਰੀਰ ਵਿਚ ਵਿਆਪਕ ਹੈ । ਪਾਣੀ ਵਿਚ ਧਰਤੀ ਵਿਚ, ਧਰਤੀ ਦੇ ਉਪਰ ਆਕਾਸ਼ ਵਿਚ ਹਰ ਥਾਂ ਮੌਜੂਦ ਹੈ ਪਰ ਲੁਕਿਆ ਹੋਇਆ ਹੈ । (ਹੇ ਮਨ!) ਗੁਰੂ ਦੇ ਸ਼ਬਦ ਦੀ ਰਾਹੀਂ ਉਸ ਨੂੰ ਵੇਖ ।ਰਹਾਉ।(ਹੇ ਭਾਈ! ਜਿਸ ਮਨੁੱਖ ਉੱਤੇ) ਗੁਰੂ ਨੇ ਸਤਿਗੁਰੂ ਨੇ ਕਿਰਪਾ ਕੀਤੀ ਉਸ ਨੂੰ ਉਸ ਨੇ ਧਰਤੀ ਆਕਾਸ਼ ਪਾਤਾਲ (ਸਾਰਾ ਜਗਤ ਪਰਮਾਤਮਾ ਦੀ ਹੋਂਦ ਨਾਲ ਭਰਪੂਰ) ਵਿਖਾ ਦਿੱਤਾ । ਉਹ ਪਰਮਾਤਮਾ ਜੂਨਾਂ ਵਿਚ ਨਹੀਂ ਆਉਂਦਾ, ਹੁਣ ਭੀ ਮੌਜੂਦ ਹੈ ਅਗਾਂਹ ਨੂੰ ਮੌਜੂਦ ਰਹੇਗਾ, (ਹੇ ਭਾਈ!) ਉਸ ਪ੍ਰਭੂ ਨੂੰ ਤੂੰ ਆਪਣੇ ਹਿਰਦੇ ਵਿਚ (ਵੱਸਦਾ) ਵੇਖ ।੨।ਇਹ ਭਾਗ-ਹੀਣ ਜਗਤ ਜਨਮ ਮਰਨ ਦਾ ਗੇੜ ਸਹੇੜ ਬੈਠਾ ਹੈ ਕਿਉਂਕਿ ਇਸ ਨੇ ਮਾਇਆ ਦੇ ਮੋਹ ਵਿਚ ਪੈ ਕੇ ਪਰਮਾਤਮਾ ਦੀ ਭਗਤੀ ਭੁਲਾ ਦਿੱਤੀ ਹੈ । ਜੇ ਸਤਿਗੁਰੂ ਮਿਲ ਪਏ ਤਾਂ ਗੁਰੂ ਦੇ ਉਪਦੇਸ਼ ਤੇ ਤੁਰਿਆਂ (ਪ੍ਰਭੂ ਦੀ ਭਗਤੀ) ਪ੍ਰਾਪਤ ਹੁੰਦੀ ਹੈ, ਪਰ ਮਾਇਆ-ਵੇੜ੍ਹੇ ਜੀਵ (ਭਗਤੀ ਤੋਂ ਖੁੰਝ ਕੇ ਮਨੁੱਖਾ ਜਨਮ ਦੀ) ਬਾਜ਼ੀ ਹਾਰ ਜਾਂਦੇ ਹਨ ।੩।ਹੇ ਸਤਿਗੁਰੂ! ਮਾਇਆ ਦੇ ਬੰਧਨ ਤੋੜ ਕੇ ਜਿਨ੍ਹਾਂ ਬੰਦਿਆਂ ਨੂੰ ਤੂੰ ਮਾਇਆ ਤੋਂ ਨਿਰਲੇਪ ਕਰ ਦੇਂਦਾ ਹੈਂ, ਉਹ ਮੁੜ ਜਨਮ ਮਰਨ ਦੇ ਗੇੜ ਵਿਚ ਨਹੀਂ ਪੈਂਦਾ । ਹੇ ਨਾਨਕ! (ਗੁਰੂ ਦੀ ਕਿਰਪਾ ਨਾਲ ਜਿਨ੍ਹਾਂ ਦੇ ਅੰਦਰ ਪਰਮਾਤਮਾ ਦੇ) ਗਿਆਨ ਦਾ ਰਤਨ ਚਮਕ ਪੈਂਦਾ ਹੈ, ਉਹਨਾਂ ਦੇ ਮਨ ਵਿਚ ਹਰੀ ਨਿਰੰਕਾਰ (ਆਪ) ਆ ਵੱਸਦਾ ਹੈ ।੪।੮।"}

	c := colly.NewCollector(
		colly.AllowedDomains("old.sgpc.net", "localhost"),
	)
	// Find and print all links
	c.OnHTML(".mw-parser-output", func(e *colly.HTMLElement) {
		links := e.ChildAttrs("a", "href")
		fmt.Println(links)
	})
	c.Visit(url)

	return result
}
